assignments/A07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-23 Tue 19:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Final Review</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="lx" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Final Review</h1>

<div id="outline-container-org4222693" class="outline-2">
<h2 id="org4222693">Logistics</h2>
<div class="outline-text-2" id="text-org4222693">
<ul class="org-ul">
<li><b>Final Exam</b> is Thursday, April 25
<ul class="org-ul">
<li>11:15am- is at your normal lab time (11:15am or 4:00pm) on Thursday, April 25.</li>
</ul></li>
<li><b>Make-up Final</b> for those unable to attend Thursday is:
<ul class="org-ul">
<li>10:15am-12:15am Thurs., May 2 (10678 lab section)</li>
<li>5:00pm-7:00pm Thurs., May 2 (29714 lab section)</li>
</ul></li>
</ul>

<p>
You may bring 1 A4 (8.5 x 11 inches) paper of original (not photocopied) hand-written notes.
</p>
</div>
</div>

<div id="outline-container-org91478c5" class="outline-2">
<h2 id="org91478c5">Topics Covered</h2>
<div class="outline-text-2" id="text-org91478c5">
</div>
<div id="outline-container-org1c635cc" class="outline-3">
<h3 id="org1c635cc">Binary Arithmetic</h3>
<div class="outline-text-3" id="text-org1c635cc">
<p>
two's complement addition/subtraction
</p>
</div>
</div>

<div id="outline-container-org9115004" class="outline-3">
<h3 id="org9115004">Python programming</h3>
<div class="outline-text-3" id="text-org9115004">
<ul class="org-ul">
<li>variables</li>
<li>loops (for, while)</li>
<li>list (array-like) indexing by number</li>
<li>dictionary (struct-like) indexing by name</li>
<li>imports and accessing members of python modules (e.g. <code>import foo</code> followed by <code>foo.example(42)</code>)</li>
</ul>
</div>
<div id="outline-container-orge205e1b" class="outline-4">
<h4 id="orge205e1b">Libraries</h4>
<div class="outline-text-4" id="text-orge205e1b">
<ul class="org-ul">
<li><code>str.split()</code></li>
<li><code>myhdl.bin()</code></li>
<li><code>sys.argv</code></li>
</ul>
</div>
</div>
<div id="outline-container-org4034549" class="outline-4">
<h4 id="org4034549">built-in datatypes</h4>
<div class="outline-text-4" id="text-org4034549">
</div>
<ul class="org-ul">
<li><a id="org3d1df37"></a>strings<br />
<div class="outline-text-5" id="text-org3d1df37">
<ul class="org-ul">
<li><code>mystring = ''</code></li>
<li><code>mystring = 'hello world!'</code></li>
<li><code>x = mystring[1:-4]</code></li>
<li><code>mystring +</code> '\n'=</li>
</ul>
</div>
</li>
<li><a id="org2ec8fe7"></a>lists<br />
<div class="outline-text-5" id="text-org2ec8fe7">
<ul class="org-ul">
<li><code>mylist = []</code></li>
<li><code>mylist = [1,3,5]</code></li>
<li><code>mylist[-1] = 10</code></li>
</ul>
</div>
</li>
<li><a id="org3933d71"></a>dictionaries<br />
<div class="outline-text-5" id="text-org3933d71">
<ul class="org-ul">
<li><code>mydictionary = {}</code></li>
<li><code>mydictionary = {'a': 1, 'b':2}</code></li>
<li><code>mydictionary['key'] = value</code></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org1b4bada" class="outline-4">
<h4 id="org1b4bada">scoping rules</h4>
<div class="outline-text-4" id="text-org1b4bada">
<ul class="org-ul">
<li>define/assign values before they're referenced</li>
<li>modifying values inside vs. outside of a function</li>
<li>returning values from a function vs. modifying values external to a function</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf8bcef9" class="outline-3">
<h3 id="orgf8bcef9">Basic Logic Gates</h3>
<div class="outline-text-3" id="text-orgf8bcef9">
<p>
Nand, Or, etc.
</p>
</div>
</div>

<div id="outline-container-org9bb6a6c" class="outline-3">
<h3 id="org9bb6a6c">Intermediate Logic Gates</h3>
<div class="outline-text-3" id="text-org9bb6a6c">
<p>
Mux, Demux, Or8Way, etc.
</p>
</div>
</div>

<div id="outline-container-orga9ecdae" class="outline-3">
<h3 id="orga9ecdae">MyHDL concepts</h3>
<div class="outline-text-3" id="text-orga9ecdae">
<ul class="org-ul">
<li>hierarchical modeling</li>
<li>difference between a <code>Signal</code> and a regular variable</li>
<li>combinational versus sequential logic</li>
<li>purpose of <code>always_comb</code> and <code>always_seq</code></li>
</ul>
</div>
<div id="outline-container-orge887b4f" class="outline-4">
<h4 id="orge887b4f">Describe required components</h4>
<div class="outline-text-4" id="text-orge887b4f">
<p>
Write interfaces (using MyHDL syntax) for each of the required top-level components of the Hack CPU:
</p>

<ul class="org-ul">
<li>Arithmetic Logic Unit (ALU)</li>
<li>Program Counter</li>
<li>A register</li>
<li>D register</li>
<li>Mux16 (example: <code>def Mux16(a, b, select, out)</code>)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2633c47" class="outline-3">
<h3 id="org2633c47">Hack CPU</h3>
<div class="outline-text-3" id="text-org2633c47">
<pre class="example">
See Slides 30 and 48 of Lecture 5

</pre>
<p>
Identify in a diagram, and describe the purpose of:
</p>
</div>
<div id="outline-container-org8b5e6b8" class="outline-4">
<h4 id="org8b5e6b8">registers</h4>
<div class="outline-text-4" id="text-org8b5e6b8">
<ul class="org-ul">
<li>how to construct a 1-bit register using a DFF and Mux</li>
<li>how to construct an N-bit register from N 1-bit registers</li>
</ul>
</div>
</div>

<div id="outline-container-org30b8003" class="outline-4">
<h4 id="org30b8003">program counter</h4>
<div class="outline-text-4" id="text-org30b8003">
<p>
purpose and behavior
</p>
</div>
</div>

<div id="outline-container-org1dac70d" class="outline-4">
<h4 id="org1dac70d">ALU</h4>
<div class="outline-text-4" id="text-org1dac70d">
<ul class="org-ul">
<li>describe purpose of input control bits and output control bits</li>
<li>how do these relate to the Hack Assembly and Hack binary formats?</li>
</ul>
</div>
</div>

<div id="outline-container-org299d917" class="outline-4">
<h4 id="org299d917">program memory, data memory</h4>
<div class="outline-text-4" id="text-org299d917">
<p>
What is each used for?
How does it relate to the symbol table?
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
